{
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Layer",
      "config": {
        "dtype": "float32",
        "batch_input_shape": [
          null,
          256,
          256,
          3
        ],
        "trainable": true,
        "name": "layer_1"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 64,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_1",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_1",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_1"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 64,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_2",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_2",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_2"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "trainable": true,
        "data_format": "channels_last",
        "strides": [
          2,
          2
        ],
        "padding": "valid",
        "name": "max_pooling2d_1",
        "pool_size": [
          2,
          2
        ]
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 128,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_3",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_3",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_3"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 128,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_4",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_4",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_4"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "trainable": true,
        "data_format": "channels_last",
        "strides": [
          2,
          2
        ],
        "padding": "valid",
        "name": "max_pooling2d_2",
        "pool_size": [
          2,
          2
        ]
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 256,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_5",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_5",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_5"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 256,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_6",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_6",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_6"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 256,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_7",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_7",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_7"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "trainable": true,
        "data_format": "channels_last",
        "strides": [
          2,
          2
        ],
        "padding": "valid",
        "name": "max_pooling2d_3",
        "pool_size": [
          2,
          2
        ]
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 512,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_8",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_8",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_8"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 512,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_9",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_9",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_9"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 512,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_10",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_10",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_10"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "trainable": true,
        "data_format": "channels_last",
        "strides": [
          2,
          2
        ],
        "padding": "valid",
        "name": "max_pooling2d_4",
        "pool_size": [
          2,
          2
        ]
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 512,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_11",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_11",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_11"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 512,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_12",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_12",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_12"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 512,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_13",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_13",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_13"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "trainable": true,
        "data_format": "channels_last",
        "strides": [
          2,
          2
        ],
        "padding": "valid",
        "name": "max_pooling2d_5",
        "pool_size": [
          2,
          2
        ]
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "size": [
          2,
          2
        ],
        "trainable": true,
        "name": "up_sampling2d_1",
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 512,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_14",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_14",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_14"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 512,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_15",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_15",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_15"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 512,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_16",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_16",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_16"
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "size": [
          2,
          2
        ],
        "trainable": true,
        "name": "up_sampling2d_2",
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 512,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_17",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_17",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_17"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 512,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_18",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_18",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_18"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 256,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_19",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_19",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_19"
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "size": [
          2,
          2
        ],
        "trainable": true,
        "name": "up_sampling2d_3",
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 256,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_20",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_20",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_20"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 256,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_21",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_21",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_21"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 128,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_22",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_22",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_22"
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "size": [
          2,
          2
        ],
        "trainable": true,
        "name": "up_sampling2d_4",
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 128,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_23",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_23",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_23"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 64,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg",
            "scale": 1.0
          }
        },
        "dilation_rate": [
          1,
          1
        ],
        "bias_regularizer": null,
        "trainable": true,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "padding": "same",
        "use_bias": true,
        "name": "conv2d_24",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_regularizer": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "axis": -1,
        "momentum": 0.99,
        "trainable": true,
        "scale": true,
        "center": true,
        "name": "batch_normalization_24",
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_24"
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "size": [
          2,
          2
        ],
        "trainable": true,
        "name": "up_sampling2d_5",
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_regularizer": null,
        "kernel_size": [
          3,
          3
        ],
        "data_format": "channels_last",
        "strides": [
          1,
          1
        ],
        "filters": 64,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
